<template>
    <div class="container">
        <div class="row">
            <div class="col-4 col-md-12">
                <h2 class="mb-30">
                    Отвечаем на частые вопросы
                </h2>
                <button class="btn mb-60">
                    Задать вопрос
                </button>
                <div class="d-flex justify-content-center align-items-center">
                    <img src="@/assets/img/faq.png" alt="">
                </div>
            </div>
            <div class="col-8 col-md-12">
                <FaqItem v-for="item, index of list" :key="index" :faq="item"/>
            </div>
        </div>
    </div>
</template>

<script>
import FaqItem from '../lib/FaqItem.vue';
export default {
    components: { FaqItem },
    data() {
        return {
            list: [
                {
                    question: 'Как проходит обучение на онлайн-курсах?',
                    answer: 'Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.'
                },
                {
                    question: 'Я покупаю пакет уроков или онлайн-курс, сколько он действует?',
                    answer: 'Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.'
                },
                {
                    question: 'Как быстро я достигну результатов?',
                    answer: 'Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.'
                },
                {
                    question: 'Когда я могу начать обучение?',
                    answer: 'Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.'
                },
                {
                    question: 'Как проходит обучение на индивидуальных занятиях?',
                    answer: 'Обучение проходит в формате видео-лекций на нашей интерактивной платформе. После приобретения курса, вы сразу же получаете письмо на почту с доступом в личный кабинет, в котором уже открыты все уроки приобретенного курса. Каждый урок состоит из видео-лекции по теме и нескольких десятков интерактивных заданий на отработку материала.'
                },
            ]
        }
    },
}
</script>

<style lang="scss">
@import '@/styles/components/faq.scss';
</style>